{
  "t1" : "Draw2PNG v1.0.0", 
  "t2" : "Draw2PNG v1.0.0", 
  "t3" : "<span class=\"helpWindowHighlight\">Draw2PNG</span> es una herramienta que puedes utilizar para <span class=\"helpWindowHighlight\">extraer el contorno de tus dibujos escaneados</span>, mejorarlos, cambiar su color ¡y más!", 
  "t4" : "Esta aplicación estaba originalmente destinada a digitalizar sprites para videojuegos dibujados a mano, como es de saber las <span class=\"helpWindowHighlight\">tabletas para dibujar pueden ser algo costosas</span> para algunas personas (como yo), así que usualmente escaneaba el dibujo, y luego lo usaba como capa guía en softwares como <span class=\"helpWindowHighlight\">Adobe Photoshop©</span> para así crear el dibujo <span class=\"helpWindowHighlight\">transparente</span> definitivo contorneando con el ratón, sin embargo, era una tarea un tanto trabajosa.", 
  "t5" : "¿Suena interesante, no es así...? así que, ¡empecemos entonces!", 
  "t6" : "En primer lugar, ten en mente que puedes seleccionar un <span class=\"helpWindowHighlight\">idioma</span> de tu preferencia, por ahora, los únicos idiomas que mi aplicación soporta son <span class=\"helpWindowHighlight\">Inglés</span> y <span class=\"helpWindowHighlight\">Español</span>, puedes fácilmente configurar eso clickeando en la pestaña <span class=\"helpWindowHighlight\">Idioma/Language</span> y luego seleccionando tu idioma preferido.", 
  "t7" : "Una vez que te sientas a gusto con el idioma de tu interfaz, puedes proceder a digitalizar tu primer dibujo. Hay dos maneras de <span class=\"helpWindowHighlight\">importar</span> tu dibujo deseado a la aplicación, la primera se puede hacer clickeando en la pestaña <span class=\"helpWindowHighlight\">Archivo</span> y luego seleccionando la opción <span class=\"helpWindowHighlight\">Abrir</span>.", 
  "t8" : "Un <span class=\"helpWindowHighlight\">diálogo de selección de archivos</span> se mostrará y podrás importar tu dibujo desde allí. La segunda manera es <span class=\"helpWindowHighlight\">arrastrándo y soltándo</span> tu dibujo sobre la aplicación.", 
  "t9" : "Puedes importar cualquiera de los siguientes tipos de imagen: <span class=\"helpWindowHighlight\">PNG, JPEG, SVG, GIF and BMP</span>, dependiendo del tamaño del archivo de tu imagen, la aplicación tomará un tiempo para leérla y mostrarla en la interfaz. Existen dos ventanas clave en la aplicación, la izquierda muestra tu <span class=\"helpWindowHighlight\">dibujo original en su tamaño original</span>, si mueves tu cursor por encima de la imagen original puedes notar que tu cursor es ahora un <span class=\"helpWindowHighlight\">cuentagotas</span>, esto significa que si clickeas en cualquier parte de tu imagen original, se establecerá la tolerancia de color a partir de píxel clickeado en el lienzo original.", 
  "t10" : "Por otra parte tenemos la <span class=\"helpWindowHighlight\">ventana de imagen de salida</span> a la derecha, esta es la ventana dónde se mostrará el trazado de nuestro dibujo, usualmente escalado al tamaño de la imagen original.", 
  "t11" : "En el panel superior, existen varios parámetros que puedes ajustar para así obtener tu salida deseada, ellos son la <span class=\"helpWindowHighlight\">Tolerancia de Color</span>, el <span class=\"helpWindowHighlight\">Color de Salida</span> y el <span class=\"helpWindowHighlight\">Color de Fondo</span>. La <span class=\"helpWindowHighlight\">Tolerancia de Color</span> es el color máximo que la aplicación considerará mientras esté escaneando tu dibujo de entrada, esto significa que todos los píxeles inferiores o iguales al color de tolerancia ajustados se mantendrán en la salida y el resto se procesarán como colores de fondo.", 
  "t12" : "El <span class=\"helpWindowHighlight\">Color de Salida</span> es el reemplazo de color que todos los colores que coincídan (inferiores/iguales que la tolerancia) en el escaneo tendrán mientras que el <span class=\"helpWindowHighlight\">Color de Fondo</span> es todo lo opuesto, básicamente el dibujo de salida constará solo de dos colores. Si la opción de <span class=\"helpWindowHighlight\">Habilitar color de salida</span> no está tildada, entonces el color de salida será ignorado y el resultado mantendrá el color original coincidído en la imagen final.", 
  "t13" : "Una vez que hayas ajustado tus parámetros deseados, tendrás que hacer click en el <span class=\"helpWindowHighlight\">Botón procesar</span> para así poder ver tu imagen de salida. Ten en mente que para un escanéo óptimo, tu dibujo deberá estar marcado lo más oscuro posible para que así el programa pueda extraer el contorno con mayor precisión, este proceso es muy parecido a la <span class=\"helpWindowHighlight\">clave cromática</span>, pero en una manera más simple. Puedes repetir este proceso re-ajustando tus parámetros hasta obtener un resultado satisfactorio, recuerda que la <span class=\"helpWindowHighlight\">Herramienta deslizadora de color de tolerancia</span> (justo al lado del color de tolerancia) facilita mucho más las cosas.", 
  "t14" : "A veces el trazado de salida con su color original no es lo suficientemente oscuro como lo esperado, puedes probar ajustando el brillo de tu imagen de salida utilizando la <span class=\"helpWindowHighlight\">Herramienta Deslizadora de Brillo</span> (justo al lado del color de fondo) para poder así darle un mejor aspecto.", 
  "t15" : "Si lo deseas, puedes hacer click en el <span class=\"helpWindowHighlight\">Botón para previsualizar en una nueva pestaña</span> para abrir la imagen procesada en una nueva pestaña/ventana. Sabiendo que hacer zoom en dispositivos móviles no es posible, esta es la única manera en que podrás hacerlo por los momentos con imágenes pequeñas.", 
  "t16" : "También puedes controlar el <span class=\"helpWindowHighlight\">zoom</span> de ambas ventanas presionando la tecla <span class=\"helpWindowHighlight\">Z</span>. Mientras presiones <span class=\"helpWindowHighlight\">Z</span> puedes usar la <span class=\"helpWindowHighlight\">rueda de tu ratón</span> para acercar o alejar el zoom, también puedes hacer uso de las teclas <span class=\"helpWindowHighlight\">I</span> y <span class=\"helpWindowHighlight\">O</span> para hacer zoom respectivamente mientras presiones <span class=\"helpWindowHighlight\">Z</span> y si presionas <span class=\"helpWindowHighlight\">R</span>, el zoom se reiniciará a su proporción original.", 
  "t17" : "El zoom se aplicará a una ventana en específico dependiendo de dónde se encuentre tu cursor, por ejemplo, si tu cursor se encuentra sobre la ventana de la imagen original, entonces el zoom se aplicará solo a esa ventana, lo mismo ocurre con la ventana de imagen de salida. Si tu cursor no se encuentra posicionado por encima de una ventana, entonces el zoom se aplicará para ambas ventanas, este comportamiento también está presente cuando se utilizan las teclas <span class=\"helpWindowHighlight\">I</span>, <span class=\"helpWindowHighlight\">O</span> y <span class=\"helpWindowHighlight\">R</span>.", 
  "t18" : "Una vez te sientas conforme con tu salida, puedes proceder a <span class=\"helpWindowHighlight\">exportarla</span>. puedes exportar tu imagen en formato <span class=\"helpWindowHighlight\">PNG</span> o <span class=\"helpWindowHighlight\">JPEG</span> clickeando <span class=\"helpWindowHighlight\">Archivo</span> y seleccionando tu tipo de imagen deseado a exportar.", 
  "t19" : "Un <span class=\"helpWindowHighlight\">diálogo de entrada</span> te pedirá un nombre para el archivo a exportar en cualquier caso, solo ingresa el nombre que desees y el navegador comenzará a descargar el archivo.", 
  "t20" : "Ten en cuenta que <span class=\"helpWindowHighlight\">algunos navegadores no soportan la descarga de archivos (como Opera)</span>, debido a que no implementan las <span class=\"helpWindowHighlight\">APIs de JavaScript</span> para <span class=\"helpWindowHighlight\">Blob</span> y <span class=\"helpWindowHighlight\">window.URL</span> requeridas por la aplicación, por lo tanto nada ocurrirá una vez que presiones <span class=\"helpWindowHighlight\">ENTER</span> o clickees <span class=\"helpWindowHighlight\">OK</span> en el diálogo de entrada. Puedes solucionar este problema dependiendo del navegador que estés utilizando, por ejemplo, <span class=\"helpWindowHighlight\">algunos navegadores te dejan descargar las imágenes a través de un menú de contexto</span> dando click derecho sobre la imagen deseada (como chrome), pero de nuevo, esto es algo que depende de la capacidad del navegador y es solo una solución parcial.", 
  "t21" : "La única versión de <span class=\"helpWindowHighlight\">Safari</span> que he probado es la ancestral <span class=\"helpWindowHighlight\">5.1.7 del 2012</span> en Windows, e <span class=\"helpWindowHighlight\">importar archivos no es posible dado a que no soporta la clase de JavaScript FileReader</span>. Con <span class=\"helpWindowHighlight\">Internet Explorer</span>... bueno... adivina... se ve terrible porque tiene <span class=\"helpWindowHighlight\">problemas con el renderizado dentro de un cuadro con scroll</span> y no <span class=\"helpWindowHighlight\">obtiene los datos de imagen correctamente</span>. Así que los navegadores más óptimos que te sugiero a usar son <span class=\"helpWindowHighlight\">Google Chrome, Mozilla Firefox, Android y Opera Browser</span> (si te atreves a buscar cómo exportar la imagen).", 
  "t22" : "A pesar de eso, no es perfecto, como todo pero si estás en <span class=\"helpWindowHighlight\">Chrome</span> (¡y espero que sea así!) tendrás la mejor experiencia, confía en mí, esta app tiene como propósito digitalizar <span class=\"helpWindowHighlight\">dibujos simples</span>, y puedes remover las imperfecciones con softwares como <span class=\"helpWindowHighlight\">Adobe Photoshop©</span> y empleando la <span class=\"helpWindowHighlight\">herramienta de borrado</span> (eso es lo que suelo hacer). Luego, podrás <span class=\"helpWindowHighlight\">pintarlo</span> y hacer lo que quieras con él, si tienes cualquier pregunta, no dudes en contactar conmigo :)", 
  "t23" : "Archivo", 
  "t24" : "Abrir", 
  "t25" : "Exportar como PNG", 
  "t26" : "Exportar como JPEG", 
  "t27" : "Language", 
  "t28" : "English", 
  "t29" : "Español", 
  "t30" : "Ayuda", 
  "t31" : "Manual", 
  "t32" : "Web del autor", 
  "t33" : "Tolerancia de color:", 
  "t34" : "Color de salida:", 
  "t35" : "Habilitar color de salida", 
  "t36" : "Color de fondo:", 
  "t37" : "Ajustar brillo de salida", 
  "t38" : "Brillo:", 
  "t39" : "Procesar", 
  "t40" : "Prev. en nueva pes.", 
  "t41" : "Z + RUEDA/I/O/R PARA ZOOM", 
  "t42" : "Tu navegador no soporta canvas de HTML5.", 
  "t43" : "Z + RUEDA/I/O/R PARA ZOOM", 
  "t44" : "Tu navegador no soporta canvas de HTML5.", 
  "t45" : "Necesitas importar al menos un archivo.", 
  "t46" : "Solo puedes importar archivos de imágenes válidos.", 
  "t47" : "Ha ocurrido un error abriendo el archivo seleccionado.", 
  "t48" : "El archivo que has seleccionado no pudo ser cargado.", 
  "t49" : "Ha ocurrido un error desconocido: El archivo seleccionado no pudo ser abierto.", 
  "t50" : "Guardar JPEG como:", 
  "t51" : "Guardar PNG como:", 
  "t52" : " trazado", 
  "t53" : "Nuevo trazo"
}